In [26]:
import pandas as pd
import numpy as np

b=pd.read_csv(r'C:\Users\charb\Downloads\cars.csv')
b.rename(columns={'Unnamed: 0':'Brand'},inplace=True)

In [37]:
df = b[['Brand','wt','cyl','gear','mpg']]
df.head()

               Brand     wt  cyl  gear   mpg
0          Mazda RX4  2.620    6     4  21.0
1      Mazda RX4 Wag  2.875    6     4  21.0
2         Datsun 710  2.320    4     4  22.8
3     Hornet 4 Drive  3.215    6     3  21.4
4  Hornet Sportabout  3.440    8     3  18.7

In [79]:
df1=pd.pivot_table(df,index='cyl', columns='gear',values='wt')
df1

gear         3         4       5
cyl
4     2.465000  2.378125  1.8265
6     3.337500  3.093750  2.7700
8     4.104083       NaN  3.3700

In [80]:
df2=pd.pivot_table(df,index='cyl', columns='gear')
df2

        mpg                      wt
gear      3       4     5         3         4       5
cyl
4     21.50  26.925  28.2  2.465000  2.378125  1.8265
6     19.75  19.750  19.7  3.337500  3.093750  2.7700
8     15.05     NaN  15.4  4.104083       NaN  3.3700

In [83]:
df1.sort_values(4,ascending=True,axis=1)

gear       5         4         3
cyl
4     1.8265  2.378125  2.465000
6     2.7700  3.093750  3.337500
8     3.3700       NaN  4.104083

In [85]:
df2.sort_values(4,ascending=True,axis=1)

          wt                        mpg
gear       5         4         3      3       4     5
cyl
4     1.8265  2.378125  2.465000  21.50  26.925  28.2
6     2.7700  3.093750  3.337500  19.75  19.750  19.7
8     3.3700       NaN  4.104083  15.05     NaN  15.4